# GS1900

# Commands
Table of commands:
| Command | Description |
|---------|-------------|
| clear   | Clear configuration |
| copy    | Copy from one file to another |
| debug   | Debug Options |
| disable | Turn off privileged mode command |
| end     | End current mode and change to enable mode |
| exit    | Exit current mode and down to previous mode |
| no      | Negate command |
| ping    | Send ICMP ECHO_REQUEST to network hosts |
| show    | Show running system information |
| traceroute  | Trace route to network hosts |

## Show

| Command | Description |
|---------|-------------|
| aaa                |AAA (Authentication, Authorization, Accounting)|
| arp                |Show the IP ARP translation table|
| backup-config      |Backup configuration|
| board              |board information|
| cable-diag         |Cable Diagnostics|    
| clock              |Display the time and date from the system clock|
| debugging          |debugging information|
| dos                |DoS information|
| dot1x              |802.1x configuration|
| errdisable         |Error Disable|
| fiber-transceiver  |Fiber ports diagnositics|
| flash              |Flash Operations|
| info               |Basic information|
| interfaces         |Interface status and configuration|
| ip                 |IP information|
| ipv6               |Set IPv6 Configuration|
| lag                |Link Aggregation Group Configuration|
| line               |To identify a specific line for configuration|
| lldp               |LLDP global configuration|
| logging            |Log Configuration|
| mac                |MAC configuration|
| management         |Specify management restrictions configuration|
| management-vlan    |Management VLAN configuration|
| mirror             |Mirror configuration|
| port-security      |Port security|
| privilege          |Local user privilege level|
| process            |process information|
| qos                |Enable/Disable QoS on the device.|
| radius             |RADIUS server information|
| rate-limit         |Bandwidth control configuration|
| running-config     |Running configuration|
| snmp               |SNMP information|
| sntp               |Simple Network Time Protocol (SNTP) information|
| spanning-tree      |Displays spanning-tree information|
| startup-config     |Startup configuration|
| storm-control      |Storm control configuration|
| tacacs             |TACACS+ server information|
| tech-support       |Show system information|
| time-range         |Display time-range configured on the switch|
| username           |Local User|
| users              |Display information about users|
| version            |System hardware and software status|
| vlan               |VLAN configuration|
| voice-vlan         |Voice VLAN configuration|

## Show interface
GS1900# show interface   
  PORTLIST    Port List
  switchport  Set switching mode characteristics

### Example

``bash
GS1900# show interface 1
GigabitEthernet1 is up
  Hardware is Gigabit Ethernet
  Auto-duplex, Auto-speed, media type is Copper
  flow-control is off
     1059016090 packets input, 2902879441 bytes, 0 throttles
     Received 57937948 broadcasts (82930444 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     82930444 multicast, 0 pause input
     0 input packets with dribble condition detected
     543385722 packets output, 2386478183 bytes, 0 underrun
     0 output errors, 0 collisions, 0 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 PAUSE output
```

```bash
GS1900# show interface 29
LAG5 is down
  Hardware is Fast Ethernet
  Auto-duplex, Auto-speed, media type is Copper
  flow-control is off
     0 packets input, 0 bytes, 0 throttles
     Received 0 broadcasts (0 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 multicast, 0 pause input
     0 input packets with dribble condition detected
     0 packets output, 0 bytes, 0 underrun
     0 output errors, 0 collisions, 0 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 PAUSE output
```

````bash
GS1900# show interface 30
LAG6 is down
  Hardware is Fast Ethernet
  Auto-duplex, Auto-speed, media type is Copper
  flow-control is off
     0 packets input, 0 bytes, 0 throttles
     Received 0 broadcasts (0 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 multicast, 0 pause input
     0 input packets with dribble condition detected
     0 packets output, 0 bytes, 0 underrun
     0 output errors, 0 collisions, 0 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 PAUSE output
```

```bash
GS1900# show interface 40
Invalid port id
``